project/tmp/20180726/report_bw-exp_25/cache/2.830000.txt

['<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><OTA_CancelRQ xmlns="http://www.opentravel.org/OTA/2003/05" CancelType="Cancel" EchoToken="ca7353d2-b7c7-4346-a95e-bca3fe950b82" PrimaryLangID="en_US" Target="Test" TimeStamp="2018-07-26T05:57:15.002Z" TransactionIdentifier="A76F92419FE74295A287EE706C261D22" Version="5.000"><UniqueID ID="BW" Instance="CHN" Type="10"/><UniqueID ID="HTL01013" Instance="CNF" Type="14"/><UniqueID ID="CHN01013" Instance="PNR" Type="14"/></OTA_CancelRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>', '<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><OTA_HotelResNotifRQ xmlns="http://www.opentravel.org/OTA/2003/05" EchoToken="REQ01013" PrimaryLangID="en_US" ResStatus="Book" Target="Test" TimeStamp="2018-07-26T05:57:12.758Z" TransactionIdentifier="4D53E046008346558EA479695F4029D2" Version="5.000"><HotelReservations><HotelReservation><POS><Source><RequestorID ID="00171010" Type="4"/><BookingChannel Type="7"><CompanyName Code="EXP2"/></BookingChannel></Source></POS><UniqueID ID="CHN01013" Instance="PNR" Type="14"/><RoomStays><RoomStay WarningRPH=""><RoomTypes><RoomType BedTypeCode="" NumberOfUnits="1" RoomTypeCode="2220471"/></RoomTypes><RoomRates><RoomRate RatePlanCode="EX2"><Rates><Rate EffectiveDate="2018-05-17" ExpireDate="2018-05-18" RateTimeUnit="Day" UnitMultiplier="1"><Base AmountAfterTax="120.000" AmountBeforeTax="120.000"/></Rate></Rates></RoomRate></RoomRates><GuestCounts><GuestCount AgeQualifyingCode="1" Count="2"/></GuestCounts><TimeSpan End="2018-05-18" Start="2018-05-17"/><Total AmountAfterTax="113.750" AmountBeforeTax="113.750" CurrencyCode="USD"/><BasicPropertyInfo ChainCode="BW" HotelCode="19010"/><ResGuestRPHs>1</ResGuestRPHs><SpecialRequests><SpecialRequest><Text>Expedia RES ID CHN01013 1 King Bed. Non-Smoking. Hotel Collect Booking Collect Payment From Guest. </Text></SpecialRequest></SpecialRequests></RoomStay></RoomStays><ResGuests><ResGuest ResGuestRPH="1"><Profiles><ProfileInfo><Profile StatusCode=""><Customer><PersonName><GivenName>Kate</GivenName><Surname>Watts</Surname></PersonName><Telephone AreaCityCode="987" CountryAccessCode="1" PhoneNumber="6787656" PhoneTechType="VOICE" PhoneUseType="4"/><Address Type="1"><AddressLine>Unknown</AddressLine></Address></Customer></Profile></ProfileInfo></Profiles></ResGuest></ResGuests><ResGlobalInfo><Guarantee GuaranteeCode="GCC"><GuaranteesAccepted><GuaranteeAccepted><PaymentCard CardCode="VI" CardNumber="5111111111111118" ExpireDate="1220"><CardHolderName>Mrs. Shelia Brown</CardHolderName></PaymentCard></GuaranteeAccepted></GuaranteesAccepted></Guarantee></ResGlobalInfo></HotelReservation></HotelReservations></OTA_HotelResNotifRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>']